#### Terraform Plan
```
module.apis.google_project_service.artifactregistry: Refreshing state... [id=lumios-490217/artifactregistry.googleapis.com]
module.apis.google_project_service.cloudresourcemanager: Refreshing state... [id=lumios-490217/cloudresourcemanager.googleapis.com]
module.apis.google_project_service.compute: Refreshing state... [id=lumios-490217/compute.googleapis.com]
module.apis.google_project_service.run: Refreshing state... [id=lumios-490217/run.googleapis.com]
module.apis.google_project_service.iam: Refreshing state... [id=lumios-490217/iam.googleapis.com]
module.apis.google_project_service.secretmanager: Refreshing state... [id=lumios-490217/secretmanager.googleapis.com]
module.storage.google_storage_bucket.photos: Refreshing state... [id=lumios-photos-lumios-490217]
module.network.google_compute_network.lumios: Refreshing state... [id=projects/lumios-490217/global/networks/lumios]
module.secrets.random_password.secret_key: Refreshing state... [id=none]
module.secrets.random_password.postgres: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret]
module.secrets.google_secret_manager_secret.secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key]
module.secrets.google_secret_manager_secret.postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password]
module.secrets.google_secret_manager_secret.google_client_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-secret]
module.secrets.random_password.jwt_secret: Refreshing state... [id=none]
module.artifact_registry.google_artifact_registry_repository.lumios: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/repositories/lumios]
module.secrets.random_password.init_admin_password: Refreshing state... [id=none]
module.secrets.google_secret_manager_secret.google_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-id]
module.secrets.google_secret_manager_secret.init_admin_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-init-admin-password]
module.secrets.google_secret_manager_secret_version.init_admin_password: Refreshing state... [id=projects/714378756224/secrets/lumios-init-admin-password/versions/1]
module.secrets.google_secret_manager_secret_version.secret_key: Refreshing state... [id=projects/714378756224/secrets/lumios-secret-key/versions/1]
module.secrets.google_secret_manager_secret_version.postgres_password: Refreshing state... [id=projects/714378756224/secrets/lumios-postgres-password/versions/1]
module.secrets.google_secret_manager_secret_version.jwt_secret: Refreshing state... [id=projects/714378756224/secrets/lumios-jwt-secret/versions/1]
module.network.google_compute_subnetwork.lumios: Refreshing state... [id=projects/lumios-490217/regions/europe-west1/subnetworks/lumios-europe-west1]
module.vm.google_service_account.vm: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-vm@lumios-490217.iam.gserviceaccount.com]
module.vm.google_compute_disk.data: Refreshing state... [id=projects/lumios-490217/zones/europe-west1-b/disks/lumios-data]
module.vm.google_compute_firewall.allow_iap_ssh: Refreshing state... [id=projects/lumios-490217/global/firewalls/lumios-allow-iap-ssh]
module.vm.google_compute_firewall.allow_db: Refreshing state... [id=projects/lumios-490217/global/firewalls/lumios-allow-db-internal]
module.vm.google_secret_manager_secret_iam_member.vm_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-vm@lumios-490217.iam.gserviceaccount.com]
module.vm.google_compute_instance.vm: Refreshing state... [id=projects/lumios-490217/zones/europe-west1-b/instances/lumios-vm]
module.cloudrun.google_service_account.cloudrun: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret.gcs_hmac_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-secret]
module.cloudrun.google_secret_manager_secret.gcs_hmac_access_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-gcs-hmac-access-key]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_postgres_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-postgres-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_jwt_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-jwt-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_client_id: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-id/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_client_secret: Refreshing state... [id=projects/lumios-490217/secrets/lumios-google-client-secret/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_service_account_iam_member.terraform_token_creator: Refreshing state... [id=projects/lumios-490217/serviceAccounts/lumios-cloudrun@lumios-490217.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:terraform@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_storage_bucket_iam_member.cloudrun_photos: Refreshing state... [id=b/lumios-photos-lumios-490217/roles/storage.objectAdmin/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_secret_key: Refreshing state... [id=projects/lumios-490217/secrets/lumios-secret-key/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_init_admin_password: Refreshing state... [id=projects/lumios-490217/secrets/lumios-init-admin-password/roles/secretmanager.secretAccessor/serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com]
module.cloudrun.google_cloud_run_v2_service.backend: Refreshing state... [id=projects/lumios-490217/locations/europe-west1/services/lumios-backend]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.cloudrun.data.google_client_openid_userinfo.terraform will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "google_client_openid_userinfo" "terraform" {
      + email = (known after apply)
      + id    = (known after apply)
    }

  # module.cloudrun.google_cloud_run_v2_service.backend is tainted, so must be replaced
-/+ resource "google_cloud_run_v2_service" "backend" {
      - annotations             = {} -> null
      ~ conditions              = [
          - {
              - last_transition_time = "2026-03-14T20:35:29.392005Z"
              - message              = <<-EOT
                    spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Secret projects/714378756224/secrets/lumios-google-client-secret/versions/latest was not found
                    spec.template.spec.containers[0].env[3].value_from.secret_key_ref.name: Permission denied on secret: projects/714378756224/secrets/lumios-gcs-hmac-access-key/versions/latest for Revision service account lumios-cloudrun@lumios-490217.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                    spec.template.spec.containers[0].env[5].value_from.secret_key_ref.name: Secret projects/714378756224/secrets/lumios-google-client-id/versions/latest was not found
                    spec.template.spec.containers[0].env[9].value_from.secret_key_ref.name: Permission denied on secret: projects/714378756224/secrets/lumios-gcs-hmac-secret/versions/latest for Revision service account lumios-cloudrun@lumios-490217.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                EOT
              - reason               = "SECRETS_ACCESS_CHECK_FAILED"
              - state                = "CONDITION_FAILED"
              - type                 = "RoutesReady"
                # (3 unchanged attributes hidden)
            },
          - {
              - last_transition_time = "2026-03-14T20:34:36.314921Z"
              - message              = <<-EOT
                    spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Secret projects/714378756224/secrets/lumios-google-client-secret/versions/latest was not found
                    spec.template.spec.containers[0].env[3].value_from.secret_key_ref.name: Permission denied on secret: projects/714378756224/secrets/lumios-gcs-hmac-access-key/versions/latest for Revision service account lumios-cloudrun@lumios-490217.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                    spec.template.spec.containers[0].env[5].value_from.secret_key_ref.name: Secret projects/714378756224/secrets/lumios-google-client-id/versions/latest was not found
                    spec.template.spec.containers[0].env[9].value_from.secret_key_ref.name: Permission denied on secret: projects/714378756224/secrets/lumios-gcs-hmac-secret/versions/latest for Revision service account lumios-cloudrun@lumios-490217.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                EOT
              - reason               = "SECRETS_ACCESS_CHECK_FAILED"
              - state                = "CONDITION_FAILED"
              - type                 = "ConfigurationsReady"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ create_time             = "2026-03-14T20:34:29.089453Z" -> (known after apply)
      ~ creator                 = "terraform@lumios-490217.iam.gserviceaccount.com" -> (known after apply)
      - custom_audiences        = [] -> null
      + delete_time             = (known after apply)
      ~ deletion_protection     = true -> false
      ~ effective_annotations   = {} -> (known after apply)
      ~ etag                    = ""CNWM180GEMjj0yo/cHJvamVjdHMvbHVtaW9zLTQ5MDIxNy9sb2NhdGlvbnMvZXVyb3BlLXdlc3QxL3NlcnZpY2VzL2x1bWlvcy1iYWNrZW5k"" -> (known after apply)
      + expire_time             = (known after apply)
      ~ generation              = "1" -> (known after apply)
      ~ id                      = "projects/lumios-490217/locations/europe-west1/services/lumios-backend" -> (known after apply)
      - invoker_iam_disabled    = false -> null
      - labels                  = {} -> null
      ~ last_modifier           = "terraform@lumios-490217.iam.gserviceaccount.com" -> (known after apply)
      ~ latest_created_revision = "projects/lumios-490217/locations/europe-west1/services/lumios-backend/revisions/lumios-backend-00001-gq6" -> (known after apply)
      + latest_ready_revision   = (known after apply)
      ~ launch_stage            = "GA" -> (known after apply)
        name                    = "lumios-backend"
      ~ observed_generation     = "1" -> (known after apply)
      ~ reconciling             = false -> (known after apply)
      ~ terminal_condition      = [
          - {
              - last_transition_time = "2026-03-14T20:35:29.392005Z"
              - message              = <<-EOT
                    spec.template.spec.containers[0].env[0].value_from.secret_key_ref.name: Secret projects/714378756224/secrets/lumios-google-client-secret/versions/latest was not found
                    spec.template.spec.containers[0].env[3].value_from.secret_key_ref.name: Permission denied on secret: projects/714378756224/secrets/lumios-gcs-hmac-access-key/versions/latest for Revision service account lumios-cloudrun@lumios-490217.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                    spec.template.spec.containers[0].env[5].value_from.secret_key_ref.name: Secret projects/714378756224/secrets/lumios-google-client-id/versions/latest was not found
                    spec.template.spec.containers[0].env[9].value_from.secret_key_ref.name: Permission denied on secret: projects/714378756224/secrets/lumios-gcs-hmac-secret/versions/latest for Revision service account lumios-cloudrun@lumios-490217.iam.gserviceaccount.com. The service account used must be granted the 'Secret Manager Secret Accessor' role (roles/secretmanager.secretAccessor) at the secret, project or higher level.
                EOT
              - reason               = "SECRETS_ACCESS_CHECK_FAILED"
              - state                = "CONDITION_FAILED"
              - type                 = "Ready"
                # (3 unchanged attributes hidden)
            },
        ] -> (known after apply)
      ~ traffic_statuses        = [] -> (known after apply)
      ~ uid                     = "0cddcd67-e551-4a6c-a03e-c07d629902fb" -> (known after apply)
      ~ update_time             = "2026-03-14T20:34:29.089453Z" -> (known after apply)
      + uri                     = (known after apply)
      ~ urls                    = [
          - "https://lumios-backend-714378756224.europe-west1.run.app",
        ] -> (known after apply)
        # (8 unchanged attributes hidden)

      - scaling {
          - manual_instance_count = 0 -> null
          - min_instance_count    = 0 -> null
            # (1 unchanged attribute hidden)
        }

      ~ template {
          - annotations                      = {} -> null
          - gpu_zonal_redundancy_disabled    = false -> null
          - labels                           = {} -> null
          ~ max_instance_request_concurrency = 80 -> (known after apply)
          - session_affinity                 = false -> null
          ~ timeout                          = "300s" -> (known after apply)
            # (4 unchanged attributes hidden)

          ~ containers {
              - args           = [] -> null
              ~ build_info     = [] -> (known after apply)
              - command        = [] -> null
              - depends_on     = [] -> null
                name           = null
                # (3 unchanged attributes hidden)

              + env {
                  + name  = "GOOGLE_FRONTEND_CLIENT_ID"
                    # (1 unchanged attribute hidden)

                  + value_source {
                      + secret_key_ref {
                          + secret  = "lumios-google-frontend-client-id"
                          + version = "latest"
                        }
                    }
                }

              ~ ports (known after apply)
              - ports {
                  - container_port = 8080 -> null
                  - name           = "http1" -> null
                }

              ~ resources {
                  - cpu_idle          = false -> null
                  - startup_cpu_boost = false -> null
                    # (1 unchanged attribute hidden)
                }

              ~ startup_probe (known after apply)
              - startup_probe {
                  - failure_threshold     = 1 -> null
                  - initial_delay_seconds = 0 -> null
                  - period_seconds        = 240 -> null
                  - timeout_seconds       = 240 -> null

                  - tcp_socket {
                      - port = 8080 -> null
                    }
                }

                # (12 unchanged blocks hidden)
            }

          ~ scaling (known after apply)

          ~ vpc_access {
                # (2 unchanged attributes hidden)

              ~ network_interfaces {
                  - tags       = [] -> null
                    # (2 unchanged attributes hidden)
                }
            }
        }

      ~ traffic (known after apply)
      - traffic {
          - percent  = 100 -> null
          - type     = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # module.cloudrun.google_secret_manager_secret_iam_member.cloudrun_google_frontend_client_id will be created
  + resource "google_secret_manager_secret_iam_member" "cloudrun_google_frontend_client_id" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:lumios-cloudrun@lumios-490217.iam.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = "lumios-google-frontend-client-id"
    }

  # module.cloudrun.google_secret_manager_secret_version.gcs_hmac_access_key will be created
  + resource "google_secret_manager_secret_version" "gcs_hmac_access_key" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = "projects/lumios-490217/secrets/lumios-gcs-hmac-access-key"
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.cloudrun.google_secret_manager_secret_version.gcs_hmac_secret will be created
  + resource "google_secret_manager_secret_version" "gcs_hmac_secret" {
      + create_time            = (known after apply)
      + deletion_policy        = "DELETE"
      + destroy_time           = (known after apply)
      + enabled                = true
      + id                     = (known after apply)
      + is_secret_data_base64  = false
      + name                   = (known after apply)
      + secret                 = "projects/lumios-490217/secrets/lumios-gcs-hmac-secret"
      + secret_data            = (sensitive value)
      + secret_data_wo_version = 0
      + version                = (known after apply)
    }

  # module.cloudrun.google_service_account_iam_member.terraform_token_creator must be replaced
-/+ resource "google_service_account_iam_member" "terraform_token_creator" {
      ~ etag               = "BwZNAgu8F+A=" -> (known after apply)
      ~ id                 = "projects/lumios-490217/serviceAccounts/lumios-cloudrun@lumios-490217.iam.gserviceaccount.com/roles/iam.serviceAccountTokenCreator/serviceAccount:terraform@lumios-490217.iam.gserviceaccount.com" -> (known after apply)
      ~ member             = "serviceAccount:terraform@lumios-490217.iam.gserviceaccount.com" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.cloudrun.google_storage_hmac_key.cloudrun will be created
  + resource "google_storage_hmac_key" "cloudrun" {
      + access_id             = (known after apply)
      + id                    = (known after apply)
      + project               = "lumios-490217"
      + secret                = (sensitive value)
      + service_account_email = "lumios-cloudrun@lumios-490217.iam.gserviceaccount.com"
      + state                 = "ACTIVE"
      + time_created          = (known after apply)
      + updated               = (known after apply)
    }

  # module.secrets.google_secret_manager_secret.google_frontend_client_id will be created
  + resource "google_secret_manager_secret" "google_frontend_client_id" {
      + create_time           = (known after apply)
      + deletion_protection   = false
      + effective_annotations = (known after apply)
      + effective_labels      = {
          + "goog-terraform-provisioned" = "true"
        }
      + expire_time           = (known after apply)
      + id                    = (known after apply)
      + name                  = (known after apply)
      + project               = "lumios-490217"
      + secret_id             = "lumios-google-frontend-client-id"
      + terraform_labels      = {
          + "goog-terraform-provisioned" = "true"
        }

      + replication {
          + auto {
            }
        }
    }

Plan: 7 to add, 0 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```